Casino.create(
  :casino_name => "サンズ・マカオ",
  :casino_name_chneng => "(金沙賭場，Sands Macau)",
  :table_number => 740,
  :pachisuro_number => 1250,
  :minimum_rate => "100HKD/20HKD",
  :address => "新口岸蒙地卡羅前地203號",
  :phone_number => "(853)2888-3388",
  :performance => "あり",
  :food_service => "あり(条件あり)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/iu1STN",
  :introduction => "カジノは2004年5月18日にオープンし、
  敷地面積はそれまでの16万5千平方フィートから22万9千フィートへと増強された。
  カジノ自体は740台のテーブルゲームを収容しているが、
  これは世界にあるどの単体カジノをも上回る規模である。
  ラスベガス・サンズ社はこの数字をもとに、
  サンズ・マカオが世界で最も大きいカジノであると主張している。"
  )

Casino.create(
  :casino_name => "グランド・リスボン",
  :casino_name_chneng => "(新葡京賭場，Grand Lisboa)",
  :table_number => 240,
  :pachisuro_number => 750,
  :minimum_rate => "100HKD/20HKD",
  :address => "新口岸葡京路",
  :phone_number => "(853)2888-3888",
  :performance => "あり",
  :food_service => "あり(ドリンク・軽食とも無料)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/l_luYe",
  :introduction => "マカオのカジノといったら、なにはなくともまずグランド・リスボアです。
ホテルに併設された巨大カジノは、マカオの象徴のひとつになっており、 大小、バカラ、ルーレット、スロットマシーンなどなんでも揃っています。
リスボアは、どこに行くにも便利なので、カジノに興味がない方もリスボア周辺を観光の拠点にするとよいでしょう。
マカオの中心部にあたる新馬路からセナド広場は徒歩10分程度、フェリーターミナルへも頻繁にバスが出ています。
カジノの集中する広州街（廣州街/Rua de Cantao）も歩いて2分ほどの距離です。 
ちなみに、リスボアカジノの中国語名は「葡京」です。
リスボン＝葡萄牙（ポルトガル）の京（みやこ）、ということで、葡京という訳です。"
  )

Casino.create(
  :casino_name => "スター・ワールド",
  :casino_name_chneng => "(星際，Star World)",
  :table_number => 290,
  :pachisuro_number => 370,
  :minimum_rate => "200HKD/20HKD",
  :address => "新口岸友誼大馬路",
  :phone_number => "(853)2838-3838",
  :performance => "あり",
  :food_service => "あり(条件あり)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/CAju0h",
  :introduction => "星際（スターワールド）は香港系のギャラクシーグループが運営するカジノで、最も豪華で大型のカジノである。
系列にワルドーやリオなどのカジノがある。
スターワールドは、特に香港スターを起用したPR戦略によって多くの香港人を客として迎えることに成功している。
星際はスマートなカジノの雰囲気を前面に押し出しており、間接照明やムーディーな音楽は、会員制バーに踏み入ったような感覚にさせる。
星際の上部にあるホテルは、各フロアの壁面に発光ダイオードを効果的に用いスタイリッシュな空間を創造している。ちょうど灯台を眺めることもでき、
星際はマカオでも有数のロマンチックなカジノ＆ホテルである。"
  )

Casino.create(
  :casino_name => "ウィン・マカオ",
  :casino_name_chneng => "(永利，Wynn Macau)",
  :table_number => 420,
  :pachisuro_number => 1280,
  :minimum_rate => "300HKD/30HKD",
  :address => "外港填海區仙德麗街",
  :phone_number => "(853)2888-9966",
  :performance => "あり",
  :food_service => "あり(条件あり)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/xc6h3r",
  :introduction => "カジノフロアの中に入るとほんのりと香水の香りが漂う粋な演出が施されています。そして長時間カジノで遊んでいると無料の食事券などのサービスが付いてきます＾＾
ウィンマカオのカジノフロアはホテルの1階にあり、ドリンク係のスタッフが常に常駐しています。他のカジノのように紙コップでドリンクを入れられるようなことはなく、しっかりとグラスでサーブしてくれるのが嬉しいですね！
ワインやビール、ジュース、アイスレモンティーなど数多く種類の中から選ぶことができます。
マカオのカジノ特有の騒々しさがなく、ワンランク上の高級感があり、落ち着いた雰囲気でカジノを楽しむことができます。
"
  )

Casino.create(
  :casino_name => "MGMグランド・マカオ",
  :casino_name_chneng => "(美高梅，MGM Grand Macau)",
  :table_number => 385,
  :pachisuro_number => 890,
  :minimum_rate => "300HKD/20HKD",
  :address => "澳門外港新填海區孫逸仙大馬路",
  :phone_number => "(853)8802-8888",
  :performance => "あり",
  :food_service => "あり(ドリンクあり)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/w7tXGN",
  :introduction => "ライオンをあしらったデザインのロゴが印象的なMGMグランドは、
  マカオに2007年12月18日オープンした。
  MGMグランドはもともとラスベガスのカジノホテルで、
  世界で３番目の大きさを誇っている。今回のMGMグランドオープンは、
  ラスベガスからついにマカオ進出となったMGMのマカオへの記念すべき第一歩である。
  ウィンやヴェネチアン・マカオなどのラスベガス・
  カジノのマカオ進出の勢いは留まるところを知らない。
マカオでオープンしたMGMグランドの建物を真横から見ると、
長方形を無造作に重ねたような形をしている。
まるで巨人が積み木を３つ置いてみたというイメージが沸いてくる。
マカオのカジノはたいてい派手なネオンとレーザーでその存在を夜の街にアピールしているが、
MGMグランドは一味違う。やわらかに波打つホテルのラインに合わせて、
横に引いたネオンが大人の空間を演出する。ラスベガスから進出のMGMグランドは、
スマートでアダルトな空間の創出に長けているのである。"
  )

Casino.create(
  :casino_name => "ザ・ベネチアン・マカオ",
  :casino_name_chneng => "(威尼斯人，The Venetian Macau)",
  :table_number => 870,
  :pachisuro_number => 3700,
  :minimum_rate => "300HKD/50HKD",
  :address => "澳門氹仔路氹星光大道",
  :phone_number => "(853)2882-8822",
  :performance => "あり",
  :food_service => "あり(ドリンクあり)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/4QIHIp",
  :introduction => "
本拠地のラスベガスをしのぐかとも思われる規模とクオリティで、
マカオのカジノブーム第二ラウンドの幕を開けた存在です。敷地面積はラスベガスのベネチアンの約2倍。
ヴェネチアンの一番の売りはなんといってもその巨大さ。
ヴェネチアンのカジノはテーブルが700台、スロットをなんと6,000台も保有する。
ホテルにいたっては3,000室もあるのだ。
しかも、3,000室すべてスイートルームと聞けば、
豪華さも並ではないことがわかる。だが、それだけではない。
ヴェネチアンは、エキゾチックなリゾートを創造するためにその苦労を厭わなかった。
彼らはホテル前に運河を流し、橋を渡し、
ゴンドラを浮かべ、ほとりに時計塔まで築いてしまったのである。
そう、マカオにヴェネチアを作ってしまったのだ。"
  )

Casino.create(
  :casino_name => "ギャラクシー・マカオ",
  :casino_name_chneng => "(銀河，Galaxy Macau)",
  :table_number => 600,
  :pachisuro_number => 1200,
  :minimum_rate => "200HKD/20HKD",
  :address => "澳門路氹望德聖母灣大馬路",
  :phone_number => "(853)2888-0888",
  :performance => "あり",
  :food_service => "あり(条件あり)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/_lU-b5",
  :introduction => "リゾート内にはマカオ唯一となる日系ホテル
  、ホテルオークラマカオも入ることから、
  日本人にも親しみやすい施設といえるでしょう。
  リゾート中央部分に位置するカジノのフロア面積は約39,000平方メートルと大規模。
  リゾートの訪問客数は1日平均約3万人と、
  常に多くの人出で賑わいます。
  ギャラクシーマカオにあるゲーミングテーブル（カジノ台）は約450台、
  スロットマシンは1,300台です。ゲーミングテーブルの中でも最も主流なのが「バカラ」、
  次いで「大小」となり、これらが大半を占めます。
  ギャラクシーマカオは今後も第2期、3期、4期と拡張工事を予定しており、
  すでに着工している直近の第2期工事は2015年中にも完成予定。
  第1期、2期トータルのカジノフロアの面積は約70,000平米、
  ゲーミングテーブル数約950台、
  スロットマシン約2,500台という世界的にも最大規模のカジノになるとのこと。"
  )

Casino.create(
  :casino_name => "シティオブドリーム・マカオ",
  :casino_name_chneng => "(新濠天地，City of Dream Macau)",
  :table_number => 350,
  :pachisuro_number => 1110,
  :minimum_rate => "100HKD/20HKD",
  :address => "澳門路氹連貫公路",
  :phone_number => "(853)8802-8888",
  :performance => "あり",
  :food_service => "あり(条件あり)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/xf-S5O",
  :introduction => "シティーオブドリームスは他にない刺激的な経験をご提供しています。
  フロアーは2階建てで42万平方フィート以上あり、
  マカオで代表的なこのカジノは450の賭博台と1,514台のゲーム機を設けて、
  あなたが更に勝つチャンスを与えます。
  シティーオブドリームスは、
  マカオでこれ以上無いほどの種類のゲーム機をご用意しております。
  昔ながらの人気ゲームから現代の最新ゲームまで、
  どなたにでも楽しんで頂けます。The Fortune Trio, 
  Fa Fa Fa 更に Celestial Dragon 
  やCelestial PhoenixやDuo Fu Duo Caiなどテーマが異なる豊富なゲームや最新鋭の
  ジャックポットを選ぶことが出来ます。"
  )

Casino.create(
  :casino_name => "サンズ・コタイセントラル",
  :casino_name_chneng => "(金沙城，Sands Cotai Central)",
  :table_number => 300,
  :pachisuro_number => 2000,
  :minimum_rate => "50HKD/20HKD",
  :address => "澳門路氹望德聖母灣大馬路 澳門金沙城中心",
  :phone_number => "(853)2886-6888",
  :performance => "あり",
  :food_service => "あり(水のみ)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/XGuQMw",
  :introduction => "サンズコタイセントラルの中央部分に位置するゲーミングフロア。
  ヒマラヤ、パシフィカという2つのテーマに分かれており、
  VIPゾーン含む合計フロア面積は約27,900平米という規模！ 
  マカオで定番のバカラなどのゲーミングテーブルを中心に、
  最新型のスロットマシンも多く揃っています。
カジノの会員クラブは同系列のヴェネチアン、
サンズ、プラザと共通の「サンズリワーズクラブ」を採用していて、会員カードは共通。
会員カードの提示で系列施設も含む一部の飲食施設やショップ、
エンターテインメントプラグラムで割引が受けられるので、
施設を訪れたらまず会員クラブに入会しておきたいもの。入会金、年会費などは一切無料です。"
  )

Casino.create(
  :casino_name => "オセアナス・カジノ・マカオ",
  :casino_name_chneng => "(海立方，Oceanus)",
  :table_number => 260,
  :pachisuro_number => 560,
  :minimum_rate => "50HKD/10HKD",
  :address => "澳門新口岸友誼大馬路1579號",
  :phone_number => "(853)8801-3388",
  :performance => "あり(時期による)",
  :food_service => "あり(条件あり)",
  :shuttle_bus => "あり",
  :freeroom_service => "なし",
  :image => "http://yahoo.jp/box/YZEg2a",
  :introduction => "マカオ初のフェリーターミナル直結カジノなのでフェリーを降りてから歩いて行けます。
  ２００９年のＯＰＥＮだけあり、かなり綺麗で、
  スタンレー・ホー氏のＳＪＭホールディングスの出資というだけあり、ど派手です。
  北京の某有名プールそっくりで派手な建物はデザインをパクっていると噂が流れていますね・・
  カジノ内ですが、ゲームは揃い中はかなり広く、座れない事はないでしょう。
  客層は大陸人より香港人、澳門人の方が多くて日本人は、かなり少ないですよ。"
  )

Casino.create(
  :casino_name => "バビロン・カジノ",
  :casino_name_chneng => "(巴比倫娛樂場，Babylon Casino)",
  :table_number => 23,
  :pachisuro_number => 78,
  :minimum_rate => "50HKD/10HKD",
  :address => "澳門漁人碼頭",
  :phone_number => "(853)2823-2288",
  :performance => "なし",
  :food_service => "あり(条件あり)",
  :shuttle_bus => "あり",
  :freeroom_service => "なし",
  :image => "http://yahoo.jp/box/hupPAs",
  :introduction => "大型テーマパーク「フィッシャーマンズ・ワーフ」内にあるので、
  買い物やお食事の前後にちょうどいい場所です。
  外観はグリーンとゴールドをメインに使ったアラブ貴族風の色で、
  中は円形になっています。店内は見渡しやすいので、
  誰が何処に居るのか解りやすい。団体で行く人にもお勧めです。
  客層は、ほぼ観光客ですが、いつもすいています。"
  )

Casino.create(
  :casino_name => "ザ・プラザ・マカオ",
  :casino_name_chneng => "(澳門百利宮，The Plaza Macao)",
  :table_number => 175,
  :pachisuro_number => 180,
  :minimum_rate => "10HKD/20HKD",
  :address => "澳門氹仔望德聖母灣大馬路,四季酒店",
  :phone_number => "(853)2881-8888",
  :performance => "あり(時期による)",
  :food_service => "あり(条件あり)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/pR6cXR ",
  :introduction => "「プラザマカオ」は、
  コタイ地区のベネチアンマカオに隣接するフォーシーズンズホテルマカオ内にある、
  2008年8月にオープンしたサンズチャイナが社が運営するラグジュアリーなカジノです。
  競争の激しいマカオホテルの中でも最上級と位置づけられるフォーシーズンズにあるプラザカジノは、
  シックで上質な雰囲気が広がる社交的な大人のエンターテイメント空間となっています。
  ハイリミットエリアでは、シャンパンやイチゴなどハイセンスなサービスを受けながらゲームを楽しむこともできます。
  周辺の大型カジノと比較すると小規模ですが、上質のサービスが提供され落ち着いてプレイすることができるので、
  エグゼクティブ層から支持されている人気のカジノです。 カジノフロアには175台のテーブルと200台のスロットマシンがあり、
  ベネチアンマカオとも直結しているので、カジノを行き来するにも便利です。
  マカオの他のカジノでは味わえないフォーシーズンズならでは贅沢な雰囲気を堪能しながらプレイすることができるカジノです。"
  )

Casino.create(
  :casino_name => "ソフィテルマカオ@ポンテ16",
  :casino_name_chneng => "(十六浦，Sofitel Macau At Ponte 16)",
  :table_number => 92,
  :pachisuro_number => 300,
  :minimum_rate => "150HKD/20HKD",
  :address => "澳門火船頭街及巴素打爾古街內港12A號",
  :phone_number => "(853)8861-0016",
  :performance => "あり(時期による)",
  :food_service => "あり(ノンアルコールのみ)",
  :shuttle_bus => "あり",
  :freeroom_service => "あり(条件あり)",
  :image => "http://yahoo.jp/box/oi9eEd",
  :introduction => "ポンテ16は、リスボア前からセナド広場前を抜ける新馬路の突き当たりに2007年末に開業したカジノである。
ポンテ16（Ponte 16）とはポルトガル語で「16番桟橋」の意味だが、この中国珠海市に面する入り江一帯は「内港（Porto Interior）」と呼ばれる歴史ある船着場である。
すなわちポンテ16とは「マカオ内港16番桟橋」。
内港の歴史は17世紀まで遡り、華やかなりし中世ポルトガルの東洋進出を支えた場所である。香港で言えばセントラルのクイーンズピア、日本で言えば横浜の赤レンガ倉庫や大桟橋と言った感じだろう。
各国の商船や客船の停泊地という役割に加え、漁船の基地としても機能し、植民地インフラの中枢を担う場所であった。
20世紀に入りカジノ業が盛んになってからも「マカオパレス（皇宮娛樂場）」なる海上カジノが内港14番桟橋に停泊し、99年に現在マカオフェリーターミナルがある外港に移転するまで、カジノの都としてのマカオを支え続けた場所でもある。
しかし、旅客ターミナルの役割が新設された外港に移転し、マカオパレスも転出すると、内港の中心地である「司打口」や「16号埠頭」周辺は急速にさびれ、ネオンが消えることのなかったナイトクラブやホテルも姿を消していった。
今回のポンテ16の開業は、華やかなりし20世紀の内港を再現するというコンセプトがある。
ゆえに、ポンテ16はノスタルジックでモダンな雰囲気に満ちている。
マカオ内港で会いましょう。
この言葉は世紀を越えたエンターテイメントを約束することだろう。"
  )

Game.create(
  :name => "ブラックジャック(Blackjack)",
  :rule => "
上の写真がゲーム開始直後\n 
下の写真がゲーム終了後の様子。\n
プレイヤーはディーラー（胴元）との間で1対1の勝負を行う。  つまり、プレイヤーが複数いる場合には、ディーラーは複数のプレイヤーと同時に勝負をすることになる。
各プレイヤーの目標は、21を超えないように手持ちのカードの\n点数の合計を21に近づけ、その点数がディーラーを上回ることである。手の中のカードの点数は、カード2～10ではその数字通りの値であり、また、絵札であるK（キング）、Q（クイーン）、J（ジャック）は10と数える。A（エース）は、手持ちのカードの合計が21を超えない範囲で11と数え、超える場合は1として数える。
各プレイヤーが初めの賭け（ベット）を終えると、ディーラーはカードを自分自身を含めた参加者全員に2枚ずつ配る。ディーラーの2枚のカードのうちの1枚は表向き（アップカード）にされ、皆が見ることができる。もう1枚のカードは伏せられている。伏せられたカードをホールカードと呼ぶ。プレイヤーの行動が全て終わった時点ではじめてディーラーの2枚目のカードが表向きで配られる。
プレイヤーのカードはカジノによって表向きの場合と裏向きの場合があるが、現在主流になっている6デッキ以上を利用するルールにおいてはフェイスアップで配られることが通例である。この時点で、プレイヤーが21（1枚は10、J、Q、Kのうちのどれかで、もう1枚はAという組み合わせの場合のみ可能）であれば「ナチュラル21」又は「ナチュラルブラックジャック」と呼ばれ、ディーラーが21でなかった場合には、ベットの2.5倍の払い出しを受ける。
プレイヤーとディーラー、双方がナチュラル21の場合には引き分けとなる。プレイヤーがナチュラル21にならず、ディーラーがナチュラル21の場合には自動的にプレイヤーの負けとなる。
次のステップでは、プレイヤーはヒットまたはスタンドの選択を行う。ルールによっては、ヒットとスタンド以外にも追加のルールを採用しているところもある
ヒット (Hit)
カードをもう1枚引く。
動作：テーブルを叩く、あるいは自分に向かって手招きをする。
スタンド (Stand)
カードを引かずにその時点の点数で勝負する。
動作：手のひらを下に向け水平に振る。
プレイヤーは21を超えなければ何回でもヒットすることができる。21を超えてしまうことをバスト（bust）と呼び、直ちにプレイヤーの負けとなる。プレイヤーが全員スタンドするとディーラーは自分のホールカードを開く。
ディーラーは、自分の手が17以上になるまでカードを引かなければならず、17以上になったら、その後は追加のカードを引くことはできない。ディーラーが21を超えた場合には、スタンドしたプレイヤーは全員勝利である。プレイヤーとディーラーが同じ点数の場合には引き分けとなる。Aと6の組み合わせの場合、ディーラーがヒットするかスタンドするかは、カジノによって異なっている。
一見すると、選択肢の多いプレイヤー側に有利かのように見えるゲームだが、バストした時点で負けであることから、先にカードを引くプレイヤー側が不利である。".gsub(/\\n/, "<br>"),
  :game_image => "http://yahoo.jp/box/anhX-4",
  :level => "★"
  )

Game.create(
  :name => "バカラ(Baccarat)",
  :rule => "バカラとは、「バンカー（banker、胴元役）」と、「プレイヤー（player、客役）」の、仮想の二人による勝負で、どちらが勝つかを客が予想して賭けるゲームである。実際にゲームをプレイしているのは仮想の人物であるため、客が出来ることは予想することだけで、それ以外でゲームに介入することが出来ない（カードを引く引かないの選択権を持たないなど）。
点数の数え方
勝負はプレイヤーとバンカー、それぞれ配られたカードの点数の合計によって決められる。Aは1点、2から9は表示どおりの点数で、10、絵札はすべて0点として数える。繰り上がりは考慮せず、繰り上がった場合でも下一桁のみを評価する。9点が一番強く、それ以降8点、7点、と続き、0点が一番弱い点数となる。
ゲームの進行
ディーラーが数組のカードをシャッフルし、シューター（和製英語。英語ではshoe）といわれるカジノ専用のカードケースに入れて行われることが多い。
ゲームに参加した人たちは「プレイヤー」側が勝つか「バンカー」側が勝つか予想し賭ける。ベット額の上限はテーブル上に表示されているMAXベット額によって一律に決められている場合と、「バランス」といって、双方サイドの賭け金額の差が一定額以下に制限される場合がある。「バランス」で差額が制限を超えている場合、超過しているサイドはベット額を減らす、または不足しているサイドへの追加ベットを求めるなどしてバランスの調整が行われる。配当原資を双方の賭け金に限定される場合または双方の賭け金が同額でないとゲームを成立させない場合を「完全バランス」といい、前者の場合は薄い側のサイドに賭けた客の配当は多く、厚い側のサイドに賭けた客の配当は少なくなる。
また、「タイ(tie)」といって、勝負が引き分けに終わるという結果に賭けることも出来る。タイはサイドベットであるため、プレイヤーかバンカーにベットした上で同時にタイにもベット出来る。ベットの上限は低く抑えられていることが多い。
プレイヤーサイド・バンカーサイド双方に2枚ずつカードが配られる。
最初の2枚で、どちらかの合計点が8点または9点の場合、ナチュラルとして即座にゲームは終了、点数の多い方が勝利となる。
最初の2枚で、プレイヤーサイド・バンカーサイド双方が6点または7点を出している際もゲームは終了する。
以上の条件に当てはまらない場合の判断は以下のようである。
プレイヤーサイドが5点以下ならプレイヤーサイドに対し、3枚目のカードが配られる。
バンカーサイドは以下の表に従ってカードが配られるか判断する。
バンカーハンド プレイヤーサイドの3枚目のカード
              なし  0 1 2 3 4 5 6 7 8 9
0                 H H H H H H H H H H H 
1                 H H H H H H H H H H H 
2                 H H H H H H H H H H H 
3                 H H H H H H H H H S H 
4                 H S S H H H H H H S S 
5                 H S S S S H H H H S S 
6                 S S S S S S S H H S S 
7                 S S S S S S S S S S S 
8                 ナチュラル(即座に終了、勝負) 

「H」なら配られ、「S」なら配られない。
配当
プレイヤーサイドにベットした場合
プレイヤーが勝利するとベットした金額と同額、つまり賭けた金額の1倍が配当される。$100ベットしていた場合には$100の配当を得られる。バンカーが勝利した場合にはベット全額が没収される。タイの時には配当なしでベットが全額返却される。
バンカーサイドにベットした場合
バンカーが勝利するとベット額の等倍の金額からコミッションが差し引かれたものが配当となる。コミッションが5%の場合、$100ベットしていた場合には$95が配当となる。プレイヤーが勝利した場合にはベット全額が没収される。タイの時には配当なしでベットが全額返却される。
なお、コミッションは通常毎ゲームの配当時ごとに徴収するが、カジノによっては合計額を記録しておきゲーム終了時やシャッフル時にまとめて徴収という場合もある。
タイにベットした場合
ゲームがタイで終了するとタイベットの配当オッズに従った配当がされる。このオッズはカジノによって異なるが8倍であることが多い。8倍の場合、$100ベットしていた場合には$800が配当となる。プレイヤーが勝利してもバンカーが勝利してもベットは全額没収される。
完全バランスのハウスでは、敗北サイドの掛け金からコミッションを引いて勝利サイドに分配する場合もある。この場合、配当が一定でないことになる。",
  :game_image => "http://yahoo.jp/box/eFLVLX",
  :level => "★★"
  )

Game.create(
  :name => "ルーレット(roulette)",
  :rule => "概要

ヨーロピアンスタイルのホイール
ホイール（回転盤）は均等に区切られたボールの落ちるポケットがあり、数字が記されている。ポケットには赤か黒かの色がついており、0（00、000）は緑色である。ホイールの種類はヨーロピアンスタイルとアメリカンスタイルの2種類が主流であり、その他にはメキシカンスタイル（39区分）などがある。ホイールの種類によって数字の並びやオッズが異なる。
ヨーロピアンスタイル 37区分（1から36、0）
アメリカンスタイル 38区分（1から36、0、00）
メキシカンスタイル 39区分（1から36、0、00、000）
メキシカンスタイルは現在ではほぼ見られない。
ゲームの手順
ディーラーがベルを1回鳴らし、ベット（賭け）の開始をプレイヤに知らせる。
プレイヤはめいめいベットを行う。
ディーラーがホイールを回転させ、ホイールと反対方向に回るようにボールを投げ入れる。
プレイヤは追加でベットを行う。あるいはベットの変更を行う。
一定時間が経過しボールが回転している間にベットの終了をディーラーが宣言する。英語の場合はノー・モア・ベットと告げ、ベルを2回鳴らすあるいはテーブルを撫でるような仕種を行う。
ボールがポケットに落ちた場所をディーラーが宣言する（例:「Red 9」）。
ディーラーが外れたチップを回収し、的中したベットに対して配当を行う。
チップには通常のチップでなくルーレット専用のプレイヤーごとに色分けされたチップを利用する。ベットを行う際は自分でテーブルの上にチップを置くか、ディーラーに宣言してチップを渡す。不明瞭なベットや締め切り後のベットはファウルとして没収される。
ハウスによって細かい部分は異なっている。ベットのタイミングは球が投げ入れられる前でも後でも良い場合が多いが、アジア地域などの一部のカジノでは投げ入れられる前にしか賭けられない場合がある。このルールは客側に大きく不利であるため、ディーラーではなく機械がボールを投げ入れる機械式のホイールを使用することがある。
多くのカジノでは出た数字の履歴を表示するボードが用意されているので、必要であれば参照することも可能である。
賭けの種類
ルーレットのベットには、赤か黒か、奇数か偶数かの配当2倍に賭けるものから、1枚賭けと呼ばれるある唯一の数が出ることに賭ける配当36倍まで、様々な賭け方が存在する。0（00、000を含む）は緑色であり、偶数や小とは認められず、アウトサイドベットに対してはディーラーの総取りとなる（オーストラリアスタイルのように、元返しとなるルールもある）。

ヨーロピアンスタイルのルーレットのテーブル
インサイドベット
1目賭け - 特定の数字1つに賭ける。配当は36倍。
2目賭け - 隣り合った数字2つに賭ける。配当は18倍。
3目賭け - 横一列の数字3つに賭ける。配当は12倍。
4目賭け - 十字の4方向にある数字4つに賭ける。配当は9倍。
5目賭け - 横2列の数字5つ（0、00、1、2、3）に賭ける。配当は7倍。唯一期待値が異なる（不利な）賭け方である上に、ハウスによっては6目賭けと同配当とするところも存在する。この賭け方を認めていないハウスも多い。
6目賭け - 横2列の数字6つに賭ける。配当は6倍。
アウトサイドベット
縦一列 - 縦1列の数字12個に賭ける。配当は3倍。
大中小 - 1～12、13～24、25～36のどれかに賭ける。配当は3倍。
前半・後半 - 1～18、19～36のどちらかに賭ける。配当は2倍。
奇数・偶数 - 奇数か偶数のどちらかに賭ける（0、00を除く）。配当は2倍。
赤・黒 - 赤色の数字か黒色の数字のどちらかに賭ける。配当は2倍。",
  :game_image => "http://yahoo.jp/box/VOxJZx",
  :level => "★"
  )

Game.create(
  :name => "大小 (Sic bo)",
  :rule => "
3個のサイコロを用いることから合計出目の最小数は3（ 1 のぞろ目）、最大数は18（ 6 のぞろ目）であり、3個のサイコロの合計出目が4以上10以下を「小」といい、11以上17以下を「大」という。出目の最小数3と最大数18は大小のルール上、大でも小でもないぞろ目に分類される。
なお、比較的類似するルーレットと異なり、さいころは完全密封された機械容器の中に入っており、蓋（不透明の取り外し可能な外蓋と固定された透明の中蓋の二重蓋。外蓋を外してもさいころに手を触れられるようにはならない）をして機械によりシャッフルし、出目が決定した後にその出目を予想してテーブル上にチップを置くことにより賭け（ルーレットと同様に置く場所によって予想を示す）、その後外蓋を開いて出目を開示する。
予想の区分は以下の5種類があり、それによって当った時の倍率も異なる。倍率はイギリス基準。マカオではこれよりも不利である（特定のぞろ目を当てた場合で151倍など）。このページの表記では日本式に掛け金を含めているが、本来の表記は掛け金を含んでいない。
単に「大」か「小」かを当てるもの。当たれば2倍。
但し、ぞろ目は大でも小でもない独立区分である。
サイコロの合計出目を当てるもの。4から17まで。合計出目が当たっていても、ぞろ目であればハズレとされ、6・9・12・15は組み合わせ数がそれぞれ一つずつ少ない。
3と18は、1と6のぞろ目を当てさせる区分に含まれるので、この区分には無い。
出目によって配当が異なる。配当率は賭けるチップを置く場所に予想出目と共に書かれている。外側（3・18に近い）ほど高配当である。当たれば7倍 - 61倍。
サイコロの3個の目のうち1個の出目を当てさせるもの（シングル、あるいはストレートと呼ばれる。ルーレットのストレートと同じ意味）。2個的中、ぞろ目（3個）的中ではより配当が高くなる（例えば 1 の目に賭けて 123 という出目ならば2倍、114 という出目ならば3倍、111 という出目ならば4倍の配当がある）。
3個のサイコロのうち2個の出目を予想させるもの。当たれば、ダブル（2個同一目。11 、33 など。ただしぞろ目を除く）が11倍、コンビネーション（異なる2個の目。12 、26 など）が7倍。
ゾロ目を当てさせるもの。単にぞろ目であることを当てる賭け方（当たれば31倍）と、特定のぞろ目数値を当てるかけ方（当たれば181倍）がある。なお、ぞろ目が出た場合、ぞろ目に賭けたものと、1つの目に賭けたもの以外は親の総取りとなる（ルーレットにおける「0」と同じ）。
配当の率は的中確率により決まっており、最低倍率の2倍から最高倍率の181倍まである。最低倍率は、単に大・小を当てる区分に賭けて的中した場合であり、最高倍率はぞろ目の出目が的中した場合である。
マカオのカジノでは最も人気のあるギャンブルの一つであり、ほとんどのカジノに大小の台が設けられている。店舗間や、同一店舗内でも台により異なるが、目の大小を当てる場合の最低賭け金は概ね50パタカ（またはほぼ等価の50香港ドル）、それ以外の部分に賭ける場合は概ね20パタカ（または20香港ドル）となっており、マカオのカジノの中では最も少ない元手で遊ぶことができる種目の一つである。ただし、50パタカのテーブルは非常に少なく、ほとんどの台は最低賭け金は100パタカ以上に設定されている。 ルーレットのディーラーがある程度出目をコントロールすることができると言われているように、大小のディーラーも密閉された容器内のサイコロの振る舞いでありながら、機械の特性の熟知によりある程度出目をコントロールできるため、完全に運・確率のみに依存したゲームではなく戦略が重要である。",
  :game_image => "http://yahoo.jp/box/RcTNeK",
  :level => "★"
  )

Game.create(
  :name => "三公バカラ(3card Baccarat)",
  :rule => "≪ 三公バカラ基本ルール ≫

★親と子(客）にカードが3枚ずつ配られます。
子が親よりカードの合計点数が高ければ勝ち、低ければ負けです。

★カードの合計点数とは、カード3枚の合計点の下一桁の点数です。
絵札（J,Q,K）は0点、その他はその数がそのまま点数となります。


≪ 三公バカラ特別ルール ≫

★3枚とも絵札の場合は三公（公とは絵札を指します）といい最強となります。
絵札とは（J,Q,K)の３種だけであり、10は絵札ではありません。

★同点の場合には絵札の枚数が多いほうが勝ちなります。

例）（K,7,5）と（2,4,6)では同じ2点ですが前者が絵札1枚の2点、後者が絵札0枚の2点ですので、前者の勝ちとなります。

強い順に、三公 ＞ 絵札2枚9点 ＞ 絵札1枚9点 ＞ ・・・ ＞ 絵札1枚0点 ＞ 絵札0枚0点 となります。

★点数も絵札の枚数も同じ場合は、引き分けとなり勝負続行となります。
ここで勝負をやめることは出来ず、次のゲームで決着をつけます。

★勝てば、配当は1.95倍です。",
  :game_image => "http://yahoo.jp/box/guW4DT",
  :level => "★★★"
  )

Game.create(
  :name => "カリビアンスタッドポーカー (Caribbran Stud Porker) ",
  :rule => "ゲームの手順
プレイヤーは、テーブルの「ANTE」と描かれた部分に賭け金を置く。
プレイヤー全員が賭け終わると、ディーラーは、自分から見て左手のプレイヤーより順に、カードを5枚ずつ伏せて配り、最後に自分に5枚を配る。
ディーラーは、自分の5枚のうち最も上の一枚を表向きにしてプレイヤーに見せる。
プレイヤーは、自分のカードとディーラーの表向きになったカードを見て、勝ち目がありそうだと思ったら、テーブルの「RAISE」と描かれた部分に、「ANTE」に賭けた額の倍額の賭け金を置き、その隣に自分のカードを伏せて置く。勝ち目がないと思った場合は、自分のカードを伏せてテーブルの中ほどに捨て、ゲームを降りる（フォールド）。ゲームを降りると、その時点で負けとなり、「ANTE」への賭け金は没収される。
プレイヤー全員が、RAISEまたは降りる意思表示を終えると、ディーラーは自分のカード全てを表向きにして、自分の手をプレイヤーに見せる。
ディーラーは、降りずにゲームに残っているプレイヤーのカードを、自分から見て左手のプレイヤーより順に開き、自分のカードと比較して、勝敗の判定と配当を行っていく。
ゲームの勝敗
ディーラーの手に、AとKが1枚ずつ含まれているか、もしくはワンペア以上の役ができている事を「クォリファイする」と言い、ディーラーはその場合に限りゲームに参加する。ディーラーの手がクォリファイしていない場合は、RAISEに賭けてプレイを続行しているプレイヤーの「ANTE」の賭け金に対し、1倍の配当を支払い、「RAISE」の賭けに対する配当は行わずにゲームを終了する。ディーラーがクォリファイした場合は、RAISEに賭けてプレイを続行しているプレイヤーの手と自分の手を比較し、プレイヤーが勝っていれば、「ANTE」の賭けに対する1倍の配当に加えて、「RAISE」の賭けに対して、プレイヤーの手のランクにより1倍から100倍の配当を支払う。逆にディーラーが勝っていれば、プレイヤーが賭けた「ANTE」「RAISE」共に没収する。このように、もしプレイヤーに高いランクの手ができていても、ディーラーの手がクォリファイしなければ、得られる配当はANTEへの1倍のみであるという部分に、このゲームにストレスを感じ易いとする原因がある。",
  :game_image => "http://yahoo.jp/box/89M-pc",
  :level => "★★★★"
  )

Game.create(
  :name => "テキサス・ホールデム(Texas hold'em)",
  :rule => "賭ける際の注意
Holdem Table-jpnversion.png
テキサス・ホールデムでは、1回のゲームで最大4回の賭けが行われる。そのうち最初の賭け（プリフロップ）の前にディーラーの左隣のふたりが強制ベットをするルールが用いられる。
ディーラー・ボタンは、ゲームに参加しているどのプレイヤーがディーラー位置にいるのかを示すために用いられる（カードを配ったりチップを扱いゲームを進行する「ディーラー」とは異なる）。ディーラー・ボタンは1ゲームごとに時計回りに移動し、ディーラーの位置及びブラインドベット対象者の変更が行われる。ディーラーボタン位置の左隣にいるプレイヤーは、スモールブラインドといって通常最低ベット額の半額を賭ける義務がある。スモールブラインドの左隣は、ビッグブラインドといって当該ゲームにおける最低ベット額を賭ける義務がある。
テーブルに残っている参加者が2名となった場合は、ボタンのないプレイヤーがビッグブラインドを、ボタンの置かれたプレイヤーがスモールブラインドをベットする。トーナメントルールにおいては、ブラインド・アンティの金額は一定時間ごとに増加していく。
賭けに関するルール
テキサス・ホールデムにおける「賭け」のルールは、以下の3種類が主に用いられている。
リミット
リングゲーム（いつでもテーブルに入り、ゲーム終了直後にいつでも終了できるタイプのゲーム）においては、アメリカのカジノで一般的なルールである。例えば「$2-4のリミット」と言われた場合は、全4回ある賭けの機会（ベットラウンドと言う）のうち、最初の2回（場にカードのない状態[プリフロップ]＆場に3枚開いた状態[フロップ]）では賭け金の単位はビッグブラインドと同額であり、後半の2回（場の四枚目[ターン]及び五枚目[リバー]）ではビッグブラインドの倍額となる。
ノーリミット
テレビ中継を行うレベルのトーナメント、特に世界選手権メインイベントで用いられているのが代表格である。ノーリミットにおいては、プレイヤーは手持ち額全額までかけることが許される（全額賭けることを「オールイン」と呼ぶ。これについてはポーカーの項を参照）。
ポットリミット
最大ベット額は、その時点での賭け金総額までとなる。
ただし、「総額」とは、本人がこれからコールする分を含む。例えばポット$30で2名がプレー、手前の人間が$10をベットした場合、その時点でのポットは$40であるが、レイズする場合は本人のコール分$10を含むため、コール時点のポット$50を基準とし、レイズのリミットは$60(コールに要する$10+ポットリミットレイズ$50)となる。
ゲームの進行
各プレイヤーに2枚のカードが表を伏せた状態で配られてゲーム開始となる。この2枚のカードを「ホールカード」あるいは「ポケットカード」と呼ぶ。ゲームにおいてプレイヤーごとに配られるのはこの2枚のみであり、ショーダウンが行われる場合以外は他のプレイヤーに公開する必要はない。
カードが配られたら、ベットラウンドが開始する。このラウンドは「プリフロップ」と呼ばれる。賭けはビッグブラインドの左隣から、時計回りに行う。このとき、ビッグブラインドはオープニングベットに相当するので、最初のプレイヤーがチェックすることはできない。スモールブラインドを出したプレイヤーがコールするには残りの半額を出す。ブラインドがない場合は、ディーラーボタンの左隣から賭けを行う。
プリフロップでの賭けが終わった段階で、2名以上プレイヤーが残っている場合はディーラーは表向きに3枚のカードをテーブルに出す。これを「フロップ」という。この3枚は全てのプレイヤーに共通のカード（コミュニティ・カード）である。この先の賭けは、全てカードが配られた時点で、ディーラー・ボタンの左隣のプレイヤーから時計回りに行われる。
フロップのベットラウンドが終わると、ディーラーは更に1枚の共通カードを開く。このカードを「ターン（またはフォース・ストリート）」と呼ぶ。同様に、ターンにおけるベットラウンドが終了すると、ディーラーは最後の1枚となる共通カードを開く。このカードを「リバー（またはフィフス・ストリート）」と呼ぶ。
リバーにおける賭けが終了した時点で、残っているプレイヤーが2名以上いる場合、勝者を決めるためにショーダウンを行う。
（ディーラーがそれぞれのコミュニティ・カードを出すときには、カードに印が付けられている可能性を考慮して、デッキの一番上のカードはコミュニティ・カードとしては使わず、カードを伏せたまま横にどかしておく。これをバーン・カードという。）
ショーダウン
2名以上のプレイヤーが最後の賭けを終えて残っている場合は、ショーダウンを行う。ショーダウンとは、プレイヤーの手元の2枚と場に出た5枚のコミュニティ・カードの中から、もっとも強い5枚の組み合わせを用いて、手の強さを競うことである。手元の2枚は両方使っても、片方だけ使っても、まったく使わなくてもかまわない。最も強い手を持つプレイヤーがポットを獲得する。
ポットを獲得する権利のある最も強い手が、複数のプレイヤーによって持たれた場合は、ポットのチップは均等に分けられて各プレイヤーに支払われる。この際、ゲームで利用している最低単位×対象人数に満たないチップについては、ディーラー・ボタンから遠いプレイヤー（つまり、最初にベットラウンドで意思表示を行わないといけないプレイヤー）から時計回りに優先される。
トーナメントルール
伝統的に、ポーカーは金銭をチップに両替して、ゲームに参加している当事者間でその得失を競うものであった。他方で、一定額の「参加料」を支払って全員が同量のチップを持ってゲームを行うトーナメント形式のゲームも行われている。
プレイヤーは、手持ちのチップを全て失った時点でトーナメントから離脱し、最終的な順位により賞金が決まるという形式である。賞金は、プレイヤーが支払った参加料の総額から、主催者の手数料、経費を取ったものとなる。
参加料の表記法として、賞金として払い戻される額と、主催者が得る手数料に分けて表記されている事が多い。例えば $500+$30 と示された場合、$530 のうち、$500 は賞金総額に加えられ、勝者に払い戻されるが、$30 は主催者の取り分である。
バリエーション
テキサス・ホールデムはフロップ・ポーカーに分類される。フロップ・ポーカーにはテキサス・ホールデム以外にも、以下のようなバリエーションがある。
オマハ・ホールデム
テキサス・ホールデムと基本は同じである。ただし最初に手札として伏札4枚配られる。
テキサス・ホールデムと違い、場の5枚のうち3枚、手札の4枚のうち2枚を必ず使わなければいけない。
パイナップル
テキサス・ホールデムの変形ルール。最初に伏札2枚配るところを3枚配って、そのうち1枚を捨ててからベット開始するゲーム。テキサス・ホールデムよりは手役が高くなる場合が多い。
クレージー・パイナップル
パイナップルは最初に1枚捨てるが、それをフロップが出てから捨てることにしたゲーム。パイナップルよりさらに高い手役ができやすくなる。
ウォーターメロン
手札を伏札4枚配り、最初に1枚捨ててベット。フロップを見てからさらに1枚捨てるゲーム。パイナップルとクレージーパイナップルを合わせたようなルール。",
  :game_image => "http://yahoo.jp/box/5U8Vx5",
  :level => "★★★★★"
  )

# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)
